<?php
/**
 * Created by PhpStorm.
 * User: slav
 * Date: 1/28/14
 * Time: 12:20 PM
 */

namespace Engine\Tools;


class SlugUri
{

    /**
     * Default map of accented and special characters to ASCII characters
     *
     * @var array
     */
    protected static $transliteration = [
        '/ä|æ|ǽ/' => 'ae',
        '/ö|œ/' => 'oe',
        '/ü/' => 'ue',
        '/Ä/' => 'Ae',
        '/Ü/' => 'Ue',
        '/Ö/' => 'Oe',
        '/À|Á|Â|Ã|Å|Ǻ|Ā|Ă|Ą|Ǎ/' => 'A',
        '/à|á|â|ã|å|ǻ|ā|ă|ą|ǎ|ª/' => 'a',
        '/Ç|Ć|Ĉ|Ċ|Č/' => 'C',
        '/ç|ć|ĉ|ċ|č/' => 'c',
        '/Ð|Ď|Đ/' => 'D',
        '/ð|ď|đ/' => 'd',
        '/È|É|Ê|Ë|Ē|Ĕ|Ė|Ę|Ě/' => 'E',
        '/è|é|ê|ë|ē|ĕ|ė|ę|ě/' => 'e',
        '/Ĝ|Ğ|Ġ|Ģ/' => 'G',
        '/ĝ|ğ|ġ|ģ/' => 'g',
        '/Ĥ|Ħ/' => 'H',
        '/ĥ|ħ/' => 'h',
        '/Ì|Í|Î|Ï|Ĩ|Ī|Ĭ|Ǐ|Į|İ/' => 'I',
        '/ì|í|î|ï|ĩ|ī|ĭ|ǐ|į|ı/' => 'i',
        '/Ĵ/' => 'J',
        '/ĵ/' => 'j',
        '/Ķ/' => 'K',
        '/ķ/' => 'k',
        '/Ĺ|Ļ|Ľ|Ŀ|Ł/' => 'L',
        '/ĺ|ļ|ľ|ŀ|ł/' => 'l',
        '/Ñ|Ń|Ņ|Ň/' => 'N',
        '/ñ|ń|ņ|ň|ŉ/' => 'n',
        '/Ò|Ó|Ô|Õ|Ō|Ŏ|Ǒ|Ő|Ơ|Ø|Ǿ/' => 'O',
        '/ò|ó|ô|õ|ō|ŏ|ǒ|ő|ơ|ø|ǿ|º/' => 'o',
        '/Ŕ|Ŗ|Ř/' => 'R',
        '/ŕ|ŗ|ř/' => 'r',
        '/Ś|Ŝ|Ş|Ș|Š/' => 'S',
        '/ś|ŝ|ş|ș|š|ſ/' => 's',
        '/Ţ|Ț|Ť|Ŧ/' => 'T',
        '/ţ|ț|ť|ŧ/' => 't',
        '/Ù|Ú|Û|Ũ|Ū|Ŭ|Ů|Ű|Ų|Ư|Ǔ|Ǖ|Ǘ|Ǚ|Ǜ/' => 'U',
        '/ù|ú|û|ũ|ū|ŭ|ů|ű|ų|ư|ǔ|ǖ|ǘ|ǚ|ǜ/' => 'u',
        '/Ý|Ÿ|Ŷ/' => 'Y',
        '/ý|ÿ|ŷ/' => 'y',
        '/Ŵ/' => 'W',
        '/ŵ/' => 'w',
        '/Ź|Ż|Ž/' => 'Z',
        '/ź|ż|ž/' => 'z',
        '/Æ|Ǽ/' => 'AE',
        '/ß/' => 'ss',
        '/Ĳ/' => 'IJ',
        '/ĳ/' => 'ij',
        '/Œ/' => 'OE',
        '/ƒ/' => 'f'
    ];

    /**
     * Map of cyrillic characters
     *
     * @var array
     */
    protected static $cyrillicTransliteration = [
        '/а/' => 'a', '/А/' => 'A',
        '/б/' => 'b', '/Б/' => 'B',
        '/в/' => 'v', '/В/' => 'V',
        '/г/' => 'g', '/Г/' => 'G',
        '/д/' => 'd', '/Д/' => 'D',
        '/е/' => 'e', '/Е/' => 'E',
        '/ё/' => 'e', '/Ё/' => 'E',
        '/ж/' => 'j', '/Ж/' => 'J',
        '/з/' => 'z', '/З/' => 'Z',
        '/и/' => 'i', '/И/' => 'I',
        '/й/' => 'y', '/Й/' => 'Y',
        '/к/' => 'k', '/К/' => 'K',
        '/л/' => 'l', '/Л/' => 'L',
        '/м/' => 'm', '/М/' => 'M',
        '/н/' => 'n', '/Н/' => 'N',
        '/о/' => 'o', '/О/' => 'O',
        '/п/' => 'p', '/П/' => 'P',
        '/р/' => 'r', '/Р/' => 'R',
        '/с/' => 's', '/С/' => 'S',
        '/т/' => 't', '/Т/' => 'T',
        '/у/' => 'u', '/У/' => 'U',
        '/ф/' => 'f', '/Ф/' => 'F',
        '/х/' => 'h', '/Х/' => 'H',
        '/ц/' => 'ts', '/Ц/' => 'Ts',
        '/ч/' => 'ch', '/Ч/' => 'Ch',
        '/ш/' => 'sh', '/Ш/' => 'Sh',
        '/щ/' => 'sch', '/Щ/' => 'Sch',
        '/ъ/' => 'y', '/Ъ/' => '',
        '/ы/' => 'yi', '/Ы/' => 'Yi',
        '/ь/' => '', '/Ь/' => '',
        '/э/' => 'e', '/Э/' => 'E',
        '/ю/' => 'yu', '/Ю/' => 'Yu',
        '/я/' => 'ya', '/Я/' => 'Ya'
    ];

    public static function slug($string, $replacement = '-')
    {
        $quotedReplacement = preg_quote($replacement, '/');

        $merge = [
            '/[^\s\p{Zs}\p{Ll}\p{Lm}\p{Lo}\p{Lt}\p{Lu}\p{Nd}]/mu' => ' ',
            '/[\s\p{Zs}]+/mu' => $replacement,
            sprintf('/^[%s]+|[%s]+$/', $quotedReplacement, $quotedReplacement) => '',
        ];

        $map = self::$transliteration + self::$cyrillicTransliteration + $merge;

        if (function_exists('mb_strtolower')) {
            $string = mb_strtolower($string, 'UTF-8');
        } else {
            $string = strtolower($string);
        }

        return preg_replace(array_keys($map), array_values($map), $string);
    }

} 